print('Бондурянський Кирило Юрійович \nЛабораторна робота №1 \nВаріант 1 \nТретє завдання \nЗнайдення відповідного значення функції залежно від введеного числа')
def is_num(symbol):
    if re.search(r'^\-?\d+\.?\d+$', symbol):
        return True
x = input('Введіть будь-яке дійсне число ')
while not is_num(x):
    x = input("Введіть будь-яке дійсне число: ")
x = float(x)
if x > 3:
    x = 1/(x**3 + 6)
    print("Введене число більше за 3 \nЗначення відповідної функції рівне " + str(x))
else:
    x = x**2 - 3*x + 9
    print("Введене число менше або рівне 3 \nЗначення відповідної функції рівне " + str(x))
